<script>
	import { Heading, P, List, Li } from 'flowbite-svelte';
</script>

<div class="m-8">
	<Heading tag="h1" class="mb-4">利用規約</Heading>
	<P class="mb-8">
		この利用規約（以下，「本規約」といいます。）は，当社がこのWebサイトで提供するサービス「TechBlog
		Hub」（以下，「本サービス」といいます。）の利用条件を定めるものです。登録ユーザーの皆さま（以下，「ユーザー」といいます。）には，本規約に従って，本サービスをご利用いただきます。
	</P>
	<div class="mb-8">
		<Heading tag="h2" class="mb-4">第1条（適用）</Heading>
		<List>
			<Li>
				本規約は，ユーザーと当社との間の本サービスの利用に関わる一切の関係に適用されるものとします。
			</Li>
			<Li>
				当社は本サービスに関し，本規約のほか，ご利用にあたってのルール等，各種の定め（以下，「個別規定」といいます。）をすることがあります。これら個別規定はその名称のいかんに関わらず，本規約の一部を構成するものとします。
			</Li>
			<Li>
				本規約の規定が前条の個別規定の規定と矛盾する場合には，個別規定において特段の定めなき限り，個別規定の規定が優先されるものとします。
			</Li>
		</List>
	</div>
	<div class="mb-8">
		<Heading tag="h2" class="mb-4">第2条（利用登録）</Heading>
		<List>
			<Li>
				本サービスにおいては，登録希望者が本規約に同意の上，当社の定める方法によって利用登録を申請し，当社がこの承認を登録希望者に通知することによって，利用登録が完了するものとします。
			</Li>
			<Li>
				当社は，利用登録の申請者に以下の事由があると判断した場合，利用登録の申請を承認しないことがあり，その理由については一切の開示義務を負わないものとします。
				<List tag="ol" class="pl-5 mt-2 space-y-1">
					<Li>利用登録の申請に際して虚偽の事項を届け出た場合</Li>
					<Li>本規約に違反したことがある者からの申請である場合</Li>
					<Li>その他，当社が利用登録を相当でないと判断した場合</Li>
				</List>
			</Li>
		</List>
	</div>
	<div class="mb-8">
		<Heading tag="h2" class="mb-4">第3条（ユーザーIDおよびパスワードの管理）</Heading>
		<List>
			<Li>
				ユーザーは，自己の責任において，本サービスのユーザーIDおよびパスワードを適切に管理するものとします。
			</Li>
			<Li>
				ユーザーは，いかなる場合にも，ユーザーIDおよびパスワードを第三者に譲渡または貸与し，もしくは第三者と共用することはできません。当社は，ユーザーIDとパスワードの組み合わせが登録情報と一致してログインされた場合には，そのユーザーIDを登録しているユーザー自身による利用とみなします。
			</Li>
			<Li>
				ユーザーID及びパスワードが第三者によって使用されたことによって生じた損害は，当社に故意又は重大な過失がある場合を除き，当社は一切の責任を負わないものとします。
			</Li>
		</List>
	</div>
	<div class="mb-8">
		<Heading tag="h2" class="mb-4">第4条（利用料金および支払方法）</Heading>
		<List>
			<Li>
				ユーザーは，本サービスの有料部分の対価として，当社が別途定め，本ウェブサイトに表示する利用料金を，当社が指定する方法により支払うものとします。
			</Li>
			<Li>
				ユーザーが利用料金の支払を遅滞した場合には，ユーザーは年14．6％の割合による遅延損害金を支払うものとします。
			</Li>
		</List>
	</div>
	<div class="mb-8">
		<Heading tag="h2" class="mb-4">第5条（禁止事項）</Heading>
		<List>
			<Li
				>ユーザーは，本サービスの利用にあたり，以下の行為をしてはなりません。
				<List tag="ol" class="pl-5 mt-2 space-y-1">
					<Li>法令または公序良俗に違反する行為</Li>
					<Li>犯罪行為に関連する行為</Li>
					<Li>
						当社，本サービスの他のユーザー，または第三者のサーバーまたはネットワークの機能を破壊したり，妨害したりする行為
					</Li>
					<Li>当社のサービスの運営を妨害するおそれのある行為</Li>
					<Li>他のユーザーに関する個人情報等を収集または蓄積する行為</Li>
					<Li>不正アクセスをし，またはこれを試みる行為</Li>
					<Li>他のユーザーに成りすます行為</Li>
					<Li>当社のサービスに関連して，反社会的勢力に対して直接または間接に利益を供与する行為</Li>
					<Li>
						当社，本サービスの他のユーザーまたは第三者の知的財産権，肖像権，プライバシー，名誉その他の権利または利益を侵害する行為
					</Li>
					<Li>
						以下の表現を含み，または含むと当社が判断する内容を本サービス上に投稿し，または送信する行為
						<List tag="ol" class="pl-5 mt-2 space-y-1">
							<Li>過度に暴力的な表現</Li>
							<Li>露骨な性的表現</Li>
							<Li>人種，国籍，信条，性別，社会的身分，門地等による差別につながる表現</Li>
							<Li>自殺，自傷行為，薬物乱用を誘引または助長する表現</Li>
							<Li>その他反社会的な内容を含み他人に不快感を与える表現</Li>
						</List>
					</Li>
					<Li>その他，当社が不適切と判断する行為</Li>
				</List>
			</Li>
		</List>
	</div>
	<div class="mb-8">
		<Heading tag="h2" class="mb-4">第6条（本サービスの提供の停止等）</Heading>
		<List>
			<Li>
				当社は，以下のいずれかの事由があると判断した場合，ユーザーに事前に通知することなく本サービスの全部または一部の提供を停止または中断することができるものとします。
				<List tag="ol" class="pl-5 mt-2 space-y-1">
					<Li>本サービスにかかるコンピュータシステムの保守点検または更新を行う場合</Li>
					<Li>
						地震，落雷，火災，停電または天災などの不可抗力により，本サービスの提供が困難となった場合
					</Li>
					<Li>コンピュータまたは通信回線等が事故により停止した場合</Li>
					<Li>その他，当社が本サービスの提供が困難と判断した場合</Li>
				</List>
			</Li>
			<Li>
				当社は，本サービスの提供の停止または中断により，ユーザーまたは第三者が被ったいかなる不利益または損害についても，一切の責任を負わないものとします。
			</Li>
		</List>
	</div>
	<div class="mb-8">
		<Heading tag="h2" class="mb-4">第7条（著作権）</Heading>
		<List>
			<Li>
				本サービス上に掲載されるコンテンツ（テキスト、リンク、画像、動画など）に関する著作権および知的財産権は、それぞれの権利保有者に帰属します。
			</Li>

			<Li>
				ユーザーは、本サービスに投稿その他送信するコンテンツ(文章や画像など全てのデータ)について、ユーザー自身が投稿その他送信することについての適法な権利を有していること、及び、第三者の権利を侵害していないことについて、当社に表明し、保証するものとします。
			</Li>
			<Li>
				ユーザーが当サービスにコンテンツを投稿する際、ユーザーは当該コンテンツに関して、当サービスの運営および利用、広告、プロモーション、派生作品の作成、または関連する法的手続きを行うための無償かつ非独占的な利用許諾を提供するものとします。
			</Li>
			<Li>
				提供されたコンテンツに対する利用許諾は、ユーザーが当サービスにコンテンツを投稿した時点から効力を有します。ユーザーはこの利用許諾を撤回することはできません。
			</Li>
			<Li>
				ユーザーは、自身が投稿したコンテンツを削除または修正する権利を有します。ただし、当サービスの運営者は、法的義務、規制、またはその他正当な理由に基づき、特定のコンテンツを削除、修正する場合があります。
			</Li>
			<Li>
				当サービスの利用者は、他者の著作権、商標、プライバシー、公開性、またはその他の権利を侵害する行為を行ってはなりません。
			</Li>
		</List>
	</div>
	<div class="mb-8">
		<Heading tag="h2" class="mb-4">第8条（利用制限および登録抹消）</Heading>
		<List>
			<Li>
				当社は，ユーザーが以下のいずれかに該当する場合には，事前の通知なく，投稿データを削除し，ユーザーに対して本サービスの全部もしくは一部の利用を制限しまたはユーザーとしての登録を抹消することができるものとします。
				<List tag="ol" class="pl-5 mt-2 space-y-1">
					<Li>本規約のいずれかの条項に違反した場合</Li>
					<Li>登録事項に虚偽の事実があることが判明した場合</Li>
					<Li>決済手段として当該ユーザーが届け出たクレジットカードが利用停止となった場合</Li>
					<Li>料金等の支払債務の不履行があった場合</Li>
					<Li>当社からの連絡に対し，一定期間返答がない場合</Li>
					<Li>本サービスについて，最終の利用から一定期間利用がない場合</Li>
					<Li>その他，当社が本サービスの利用を適当でないと判断した場合</Li>
				</List>
			</Li>
			<Li>
				前項各号のいずれかに該当した場合，ユーザーは，当然に当社に対する一切の債務について期限の利益を失い，その時点において負担する一切の債務を直ちに一括して弁済しなければなりません。
			</Li>
			<Li>
				当社は，本条に基づき当社が行った行為によりユーザーに生じた損害について，一切の責任を負いません。
			</Li>
		</List>
	</div>
	<div class="mb-8">
		<Heading tag="h2" class="mb-4">第9条（退会）</Heading>
		<List>
			<Li>ユーザーは，当社の定める退会手続により，本サービスから退会できるものとします。</Li>
		</List>
	</div>
	<div class="mb-8">
		<Heading tag="h2" class="mb-4">第10条（保証の否認および免責事項）</Heading>
		<List>
			<Li>
				当社は，本サービスに事実上または法律上の瑕疵（安全性，信頼性，正確性，完全性，有効性，特定の目的への適合性，セキュリティなどに関する欠陥，エラーやバグ，権利侵害などを含みます。）がないことを明示的にも黙示的にも保証しておりません。
			</Li>
			<Li>
				当社は，本サービスに起因してユーザーに生じたあらゆる損害について、当社の故意又は重過失による場合を除き、一切の責任を負いません。ただし，本サービスに関する当社とユーザーとの間の契約（本規約を含みます。）が消費者契約法に定める消費者契約となる場合，この免責規定は適用されません。
			</Li>
			<Li>
				前項ただし書に定める場合であっても，当社は，当社の過失（重過失を除きます。）による債務不履行または不法行為によりユーザーに生じた損害のうち特別な事情から生じた損害（当社またはユーザーが損害発生につき予見し，または予見し得た場合を含みます。）について一切の責任を負いません。また，当社の過失（重過失を除きます。）による債務不履行または不法行為によりユーザーに生じた損害の賠償は，ユーザーから当該損害が発生した月に受領した利用料の額を上限とします。
			</Li>
			<Li>
				当社は，本サービスに関して，ユーザーと他のユーザーまたは第三者との間において生じた取引，連絡または紛争等について一切責任を負いません。
			</Li>
		</List>
	</div>
	<div class="mb-8">
		<Heading tag="h2" class="mb-4">第11条（サービス内容の変更等）</Heading>
		<List>
			<Li>
				当社は，ユーザーへの事前の告知をもって、本サービスの内容を変更、追加または廃止することがあり、ユーザーはこれを承諾するものとします。
			</Li>
		</List>
	</div>
	<div class="mb-8">
		<Heading tag="h2" class="mb-4">第12条（利用規約の変更）</Heading>
		<List>
			<Li>
				当社は以下の場合には、ユーザーの個別の同意を要せず、本規約を変更することができるものとします。
			</Li>
			<Li>本規約の変更がユーザーの一般の利益に適合するとき。</Li>
			<Li>
				本規約の変更が本サービス利用契約の目的に反せず、かつ、変更の必要性、変更後の内容の相当性その他の変更に係る事情に照らして合理的なものであるとき。
			</Li>
			<Li>
				当社はユーザーに対し、前項による本規約の変更にあたり、事前に、本規約を変更する旨及び変更後の本規約の内容並びにその効力発生時期を通知します。
			</Li>
		</List>
	</div>
	<div class="mb-8">
		<Heading tag="h2" class="mb-4">第13条（個人情報の取扱い）</Heading>
		<List>
			<Li>
				当社は，本サービスの利用によって取得する個人情報については，当社「プライバシーポリシー」に従い適切に取り扱うものとします。
			</Li>
		</List>
	</div>
	<div class="mb-8">
		<Heading tag="h2" class="mb-4">第14条（通知または連絡）</Heading>
		<List>
			<Li>
				ユーザーと当社との間の通知または連絡は，当社の定める方法によって行うものとします。当社は,ユーザーから,当社が別途定める方式に従った変更届け出がない限り,現在登録されている連絡先が有効なものとみなして当該連絡先へ通知または連絡を行い,これらは,発信時にユーザーへ到達したものとみなします。
			</Li>
		</List>
	</div>
	<div class="mb-8">
		<Heading tag="h2" class="mb-4">第15条（権利義務の譲渡の禁止）</Heading>
		<List>
			<Li>
				ユーザーは，当社の書面による事前の承諾なく，利用契約上の地位または本規約に基づく権利もしくは義務を第三者に譲渡し，または担保に供することはできません。
			</Li>
		</List>
	</div>
	<div class="mb-8">
		<Heading tag="h2" class="mb-4">第16条（準拠法・裁判管轄）</Heading>
		<List>
			<Li>本規約の解釈にあたっては，日本法を準拠法とします。</Li>
			<Li>
				本サービスに関して紛争が生じた場合には，当社の本店所在地を管轄する裁判所を専属的合意管轄とします。
			</Li>
		</List>
	</div>
</div>
